# Dataframe:

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    "Name" : ["Alice","Bob","Charlie","David","Eve","Alice"],
    "Age" : [25,30,35,np.nan,29,25],
    "Department" : ["HR","IT","Finance","IT","HR","HR"],
    "Salary" :[50000,60000,70000,62000,np.nan,50000]
}
data
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [3]:
df.head(2)

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

In [4]:
df.tail(3)

    Name   Age Department   Salary
3  David   NaN         IT  62000.0
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [5]:
#loc and iloc
df.iloc[2:4]

      Name   Age Department   Salary
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0

In [6]:
df.loc[1:3,["Age","Department"]]

    Age Department
1  30.0         IT
2  35.0    Finance
3   NaN         IT

In [7]:
#one column
df[["Age","Department"]]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [8]:
df.drop("Age", axis =1)

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [10]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

In [11]:
# Broadcasting
df["Salary"] =df["Salary"] + 5000
df["Salary"]

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Salary, dtype: float64

In [12]:
# Rename a column
df.rename(columns  = {"Department" : "Dept"},inplace = True)
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  55000.0
1      Bob  30.0       IT  65000.0
2  Charlie  35.0  Finance  75000.0
3    David   NaN       IT  67000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  55000.0

In [13]:
df[["Age"]].unique()`

SyntaxError: invalid syntax (3256340135.py, line 1)

In [ ]:
df[["Dept"]].value_counts()

In [ ]:
df["Promoted Salary"]= df["Salary"] * 10
df

In [ ]:
# Data Cleaning 
df.isnull().sum()

In [ ]:
df.dropna(how ='any') #any row that had any null value

In [ ]:
df[["Age"]].fillna(df["Age"].mean())

In [ ]:
df[["Salary"]].fillna(df["Salary"].median())

In [ ]:
df[["Age"]].fillna(method ='ffill')

In [ ]:
df["Name"]=df["Name"].replace("Charlie","Rose")
df

In [ ]:
#Duplicates:
df_dup = df[df.duplicated(keep = 'first')]
df_dup

In [ ]:
df = df.drop_duplicates()
df`

In [ ]:
#lambda -> python
df["Promoted Salary"] = df["Promoted Salary"].apply(lambda x: x/10 if x >650000 else x)
df

### name = "alice_fernandes"
df[["first_name","last_name"]] = df["name"].str.split("_")
df

In [ ]:
#apply and lambda
def multiplying_age(x):
    return x*2

df["Age"] = df["Age"].apply(multiplying_age)
df

In [ ]:
df["Age"] = df["Age"].apply(lambda x: x/2)
df

In [15]:
#joins and Merges
department_info = {
    "Dept" : ["Hr" , "IT","Finanace"],
    "loaction": ["New York","San Francisco","Chicago"],
    "Manager" : ["Laura","Steve","Nina"]
}
df2 = pd.DataFrame(department_info)
df2

       Dept       loaction Manager
0        Hr       New York   Laura
1        IT  San Francisco   Steve
2  Finanace        Chicago    Nina

In [16]:
#concat
pd.concat([df,df2])

      Name   Age      Dept   Salary       loaction Manager
0    Alice  25.0        HR  55000.0            NaN     NaN
1      Bob  30.0        IT  65000.0            NaN     NaN
2  Charlie  35.0   Finance  75000.0            NaN     NaN
3    David   NaN        IT  67000.0            NaN     NaN
4      Eve  29.0        HR      NaN            NaN     NaN
5    Alice  25.0        HR  55000.0            NaN     NaN
0      NaN   NaN        Hr      NaN       New York   Laura
1      NaN   NaN        IT      NaN  San Francisco   Steve
2      NaN   NaN  Finanace      NaN        Chicago    Nina

In [17]:
pd.concat([df,df2],axis = 1)

      Name   Age     Dept   Salary      Dept       loaction Manager
0    Alice  25.0       HR  55000.0        Hr       New York   Laura
1      Bob  30.0       IT  65000.0        IT  San Francisco   Steve
2  Charlie  35.0  Finance  75000.0  Finanace        Chicago    Nina
3    David   NaN       IT  67000.0       NaN            NaN     NaN
4      Eve  29.0       HR      NaN       NaN            NaN     NaN
5    Alice  25.0       HR  55000.0       NaN            NaN     NaN

In [27]:
pd.merge(df, df2, on = "Dept")

    Name   Age Dept   Salary       loaction Manager
0    Bob  30.0   IT  65000.0  San Francisco   Steve
1  David   NaN   IT  67000.0  San Francisco   Steve

In [48]:
# importing file 
data = pd.read_csv("C:\\Users\\zaina\\OneDrive\\Documents\\zainabdoc\\hw_200.csv")

In [49]:
data.head()

   Index   Height(Inches)"   "Weight(Pounds)"
0      1             65.78             112.99
1      2             71.52             136.49
2      3             69.40             153.03
3      4             68.22             142.34
4      5             67.79             144.30

In [35]:
data.shape

(200, 3)

In [50]:
data.describe()

            Index   Height(Inches)"   "Weight(Pounds)"
count  200.000000        200.000000         200.000000
mean   100.500000         67.949800         127.221950
std     57.879185          1.940363          11.960959
min      1.000000         63.430000          97.900000
25%     50.750000         66.522500         119.895000
50%    100.500000         67.935000         127.875000
75%    150.250000         69.202500         136.097500
max    200.000000         73.900000         158.960000

In [37]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Index              200 non-null    int64
 1    Height(Inches)"   200 non-null    float64
 2    "Weight(Pounds)"  200 non-null    float64
dtypes: float64(2), int64(1)
memory usage: 4.8 KB

In [51]:
data.columns
data

     Index   Height(Inches)"   "Weight(Pounds)"
0        1             65.78             112.99
1        2             71.52             136.49
2        3             69.40             153.03
3        4             68.22             142.34
4        5             67.79             144.30
..     ...               ...                ...
195    196             65.80             120.84
196    197             66.11             115.78
197    198             68.24             128.30
198    199             68.02             127.47
199    200             71.39             127.88

[200 rows x 3 columns]

In [55]:
data.columns.tolist()

['Index', ' Height(Inches)"', ' "Weight(Pounds)"']

In [68]:
data= data.drop_duplicates()
data

     Index  Height(Inches)  Weight(Pounds)
0        1           65.78          112.99
1        2           71.52          136.49
2        3           69.40          153.03
3        4           68.22          142.34
4        5           67.79          144.30
..     ...             ...             ...
195    196           65.80          120.84
196    197           66.11          115.78
197    198           68.24          128.30
198    199           68.02          127.47
199    200           71.39          127.88

[200 rows x 3 columns]

In [69]:
# Clean the column names once
data.columns = data.columns.str.strip().str.replace('"', '')

In [70]:
avg_height = data['Height(Inches)'].mean()
print("Average Height:",avg_height)

Average Height: 67.9498

In [72]:
data['Height(Inches)'].max()

73.9

In [79]:
tallest_person = data.loc[data["Height(Inches)"].idxmax()]
print("Tallest person's record:")
print(tallest_person)

Tallest person's record:
Index             139.00
Height(Inches)     73.90
Weight(Pounds)    151.39
Name: 138, dtype: float64